uploads/customers/123/supportdesk/9444/comments/XML.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://wservice.rtt.co.za/ws_ToysRus/">
   <soapenv:Header/>
   <soapenv:Body>
      <ws:SuplierMaster>
         <ws:supplierMasterHeader>
            <!--Optional:-->
            <ws:StorerKey>6000</ws:StorerKey>
            <!--Optional:-->
            <ws:Type>5</ws:Type>
            <!--Optional:-->
            <ws:Description>test</ws:Description>
            <!--Optional:-->
            <ws:Company>test</ws:Company>
            <!--Optional:-->
            <ws:Vat>14</ws:Vat>
            <!--Optional:-->
            <ws:Address1>1</ws:Address1>
            <!--Optional:-->
            <ws:Address2>2</ws:Address2>
            <!--Optional:-->
            <ws:Address3>3</ws:Address3>
            <!--Optional:-->
            <ws:Address4>4</ws:Address4>
            <!--Optional:-->
            <ws:City>City</ws:City>
            <!--Optional:-->
            <ws:State>State</ws:State>
            <!--Optional:-->
            <ws:Zip>1234</ws:Zip>
            <!--Optional:-->
            <ws:Country>SA</ws:Country>
            <!--Optional:-->
            <ws:ISOCntryCode>11</ws:ISOCntryCode>
            <!--Optional:-->
            <ws:Contact1>Test1</ws:Contact1>
            <!--Optional:-->
            <ws:Contact2>test2</ws:Contact2>
            <!--Optional:-->
            <ws:Phone1>11111111</ws:Phone1>
            <!--Optional:-->
            <ws:Phone2>2222222</ws:Phone2>
            <!--Optional:-->
            <ws:Fax1>333333</ws:Fax1>
            <!--Optional:-->
            <ws:Fax2>44444</ws:Fax2>
            <!--Optional:-->
            <ws:Email1>wilma.mulder@rtt.co.za</ws:Email1>
            <!--Optional:-->
            <ws:Email2>wilma.mulder@rtt.co.za</ws:Email2>
            <!--Optional:-->
            <ws:Title1>m</ws:Title1>
            <!--Optional:-->
            <ws:Title2>m</ws:Title2>
            <!--Optional:-->
           <ws:AccountingEntity>1212</ws:AccountingEntity>
         </ws:supplierMasterHeader>
      </ws:SuplierMaster>
   </soapenv:Body>
</soapenv:Envelope>
